import React, { Component } from 'react';
import '../../custom.css';
import '../Specialities/SpecialitiesStyles.css';
import { IoChevronBackCircle } from "react-icons/io5";

export class Informatics extends Component {
    static displayName = Informatics.name;

    render() {
        return (
            <div>
                <div className="specialityInfoContainer">
                    <div className="specialityTitle">
                        <h3 id="specialityTitle">Информатика</h3>
                    </div>
                    <a href="schedule" className="specialitiesBackBtn"><IoChevronBackCircle /></a>
                    
                    <div className="specialityInfoContent">
                        <p>
                            Успешно дипломиралите се в бакалавърска степен имат необходимата подготовка, за да продължат образованието си в магистърска степен в областта на информатиката при доказани способности за научно-изследователска работа.
                        </p>
                        <p>
                            Специалистите, завършили успешно бакалавърската степен на специалност “Информатика”, имат необходимите теоретични знания и практически умения, за да работят във всички фирми, учреждения и организации в сферата на производството, услугите и администрацията, където се използват компютърна техника и информационни технологии.
                        </p>
                        <p>
                            Квалификацията, придобита по време на следването, им позволява да заемат длъжности като:
                        </p>
                            <ul className="jobs">
                                <li>системен аналитик</li>
                                <li>приложен програмист</li>
                                <li>администратор на информационна система</li>
                                <li>администратор на база данни</li>
                                <li>отговорник за информационното обслужване на предприятие</li>
                                <li>Web-дизайнер</li>
                            </ul>
                        
                        <p>
                            Нивото на подготовка на бакалаврите по информатика ги прави конкурентноспособни и на международния пазар на работна ръка. Те могат да участват в реализацията на международни проекти в областта на информационните технологии и успешно да се конкурират за работно място както в представителства на чуждестранни ИТ фирми у нас, така и в чужбина.
                            Специалистите по информатика са сред най-добре платените специалисти, а търсенето им на пазара на труда е традиционно високо.
                            Квалификационната характеристика е неотменна част от учебния план. Тя се приема от съвета на звеното (Факултет/Колеж) и се утвърждава на Академичен съвет по реда, установен за учебните планове.
                        </p>
                    </div>
                </div>
            </div>
        );
    }
}
