import React, { Component } from 'react';
import '../../custom.css';
import '../Specialities/SpecialitiesStyles.css';
import { IoChevronBackCircle } from "react-icons/io5";

export class InformationBrokerage extends Component {

    render() {
        return (
            <div>
                <div className="specialityInfoContainer">
                    <div className="specialityTitle">
                        <h3 id="specialityTitle">Информационно брокерство и дигитални медии</h3>
                    </div>
                    <a href="schedule" className="specialitiesBackBtn"><IoChevronBackCircle /></a>

                    <div className="specialityInfoContent">
                        <p>
                            Специалността „Информационно брокерство и дигитални медии” е пряко следствие от новите предизвикателства, които постави  пазарът на труда информационната революция и проникването на информационните технологии във всяка сфера на стопанска дейност.
                            Това определят възникващата необходимост от специализирано обучение по професията НКПД 2511 6002
                            Бизнес анализатор, информационни технологии – нова функционална роля,
                            която се превръща в ключова за развитието на средните
                            и големите предприятия с персонал над 50 заети лица .
                            По данни на НСИ за Северен централен район (характерен за привличане на студенти  за ВТУ)
                            броя на тези предприятия е повече от 600.
                            От друга страна развитието на бизнес средата формира
                            и нова роля за библиотеките с акцент върху информационното консултиране.
                            Това обуславя и насочването към професионална реализация като НКПД 2622 5009 Библиограф-информатор.
                        </p>
                    </div>
                </div>
            </div>
        );
    }
}
