import React, { Component } from 'react';
import '../../custom.css';
import '../Specialities/SpecialitiesStyles.css';
import { IoChevronBackCircle } from "react-icons/io5";

export class Pedagogy extends Component {

    render() {
        return (
            <div>
                <div className="specialityInfoContainer">
                    <div className="specialityTitle">
                        <h3 id="specialityTitle">Педагогика на обучението по математика и информатика</h3>
                    </div>
                    <a href="schedule" className="specialitiesBackBtn"><IoChevronBackCircle /></a>

                    <div className="specialityInfoContent">
                        <p>
                            Обучението в бакалавърската програма „Педагогика на обучението по математика и информатика“ е насочено към подготовка на специалисти и експерти в различни направления и сфери,
                            изискващи компетенции по спецификата на образованието по математика,
                            информатика и информационни технологии. Завършилите тази специалност се реализират като:
                            <ul className="jobs">
                                <li>учител по математика, по информатика и информационни технологии (общообразователна подготовка за преподаване в 5. – 12. клас),
                                    по компютърно моделиране</li>
                                <li>учител/преподавател по информационни технологии в занимания по интереси</li>
                                <li>експерт, обучение и квалификация по математика, информатика и информационни технологии</li>
                                <li>преподавател в областта на математиката, информатиката и информационните технологии в корпоративни центрове за обучение и
                                    центрове за професионално обучение на студенти и учители</li>
                                <li>методик или експерт по математика, информатика или информационни технологии към РУО и МОН</li>
                                <li>ръководител компютърни кабинети в училище</li>
                                <li>системен администратор в образователна институция</li>
                                <li>проектант на електронни учебни материали</li>
                                <li>консултант по приложение на информационните технологии в обучението</li>
                            </ul>
                        </p>
                    </div>
                </div>
            </div>
        );
    }
}
